function methods() {
    let arr = [1, 2, 3, 4];

    //      /1/  .push() - добавя елемент в края на масива
    //     arr.push(5)<--- в случая добавя 5
    //     console.log(arr);---/[1,2,3,4,5]

    //      /2/   .pop() - премахва/взима последния елемент от масива
    //      arr.pop() - в случая премахва 4 (премахнатия елемент може да се сложи в променлива
    //      и да работим с нея)
    //      console.log(arr); ---/[1,2,3]

    //      /3/   .unshift() - добавя елемент в началото на масива(на 0 индес)
    //      arr.unshift(0)
    //      console.log(arr); ---/[0,1,2,3,4]


    //      /4/   .shift()   - премахва първия елемент от масива(на 0 индекс)
    //      arr.shift()
    //      console.log(arr); ---/ [2,3,4]

    //      /5/  .includes(число/стринг)  - проверява дали масива съдържа в себе си
    //      елемента в скобите.Връща true/false
    //      arr.includes(9)
    //      console.log(arr.includes(9)); ---false

    //      /6/  .indexOf() - в скобите слагаме елемент от масива и този метод ни
    //              връща на кой индекс се намира.Ако в скобите сложим елемент, който не съществува
    //                 в масива ни се връща (индекс -1)
    //       console.log(arr.indexOf(4)); --- 3 индекс

    //       /7/  .slice() - създава нов масив/променлива, "изрязвайки" част/парче от друг, вече създаден масив.
    //      Старият масив остава непроменен !!! 
    //      Приема начален и краен елемент от масива
    //      Пример 1:


    //      let slised = arr.slice(2) - т.е изразвя всичко от 2 индекс до края на масива
    //      console.log(slised); ---[3, 4]

    //      Пример 2 :
    //      let slised = arr.slice(1, 3); -изрязва всичко м/у 1 и 3, като 3 е само крайна точка.
    //      Последния взет елемент е на  2ри индекс
    //      console.log(slised); ---[2, 3]

    //      Ако сложим елементи за рязане с отицателен знак(пример -1,-2,-3), ще започне да взимат елементите
    //      от масива отзад напред.

    //     let slised = arr.slice(1, -1)
    //      console.log(slised); ---[2, 3] - маха 1вия и последния елемент;


    //        /8/ .splice() - За разлика от slice , не създава нов масив, а променя оригиналния. 
    //         
    //         Можем да вземем израязаното в нова променлива/масив.

    //   arr.splice(2, 3) - първият елемент(2) в скобите дава началнич индекс от който ще режем, а втория(3) 
    //   броят на елементите, които ще режем.
    //  console.log(arr);

    //  Може да реже елементи от индекс до индекс или дада вмъква други елементи.

    // Пример
    // arr.splice(2, 1, `Kaloyan`)
    // console.log(arr); ---[1, 2, `Kaloyan`, 4]


    // //       /9/.map() - обхожда всички елементи и изпълнява зададена функция с тях.
    //          let sum = arr.map((el) => el * 2)
    //          console.log(sum);



}
methods();
